# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/php'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'grep'

# Install Binaries
brew 'ffmpeg'
brew 'gdal'
brew 'git'
brew 'gradle'
brew 'htop-osx'
brew 'imagemagick'
brew 'mackup'
brew 'mas'
brew 'trash'
brew 'wget'
brew 'yarn', args: ['without-node']
brew 'youtube-dl'

# Development
brew 'php71'
brew 'php71-intl'
brew 'mariadb'
brew 'mongodb'

# Apps
cask 'alfred'
cask 'android-file-transfer'
cask 'java'
cask 'android-sdk'
cask 'anki'
cask 'carbon-copy-cloner'
cask 'colorsnapper'
cask 'dash'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'gpgtools'
cask 'imagealpha'
cask 'imageoptim'
cask 'iterm2'
cask 'little-snitch'
cask 'postman'
cask 'sencha'
cask 'sequel-pro'
cask 'sketch'
cask 'skype'
cask 'slack'
cask 'sourcetree'
cask 'sublime-text'
cask 'torbrowser'
cask 'transmission'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'

# Old app versions (https://www.jverdeyen.be/mac/downgrade-brew-cask-application)
cask 'https://github.com/caskroom/homebrew-cask/raw/3524361d2174fb76a99c1e2522139a5d3cd953de/Casks/phpstorm.rb' # version 2016.1.2

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-open-sans'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install Mac App Store apps
mas '1Password', id: 443987910
mas 'DaisyDisk', id: 411643860
mas 'GIPHY CAPTURE', id: 668208984
mas 'Magnet', id: 441258766
mas 'Pixelmator', id: 407963104
mas 'SnippetsLab', id: 1006087419
mas 'The Unarchiver', id: 425424353
mas 'Things3', id: 904280696
mas 'Transmit', id: 403388562
mas 'Tweetbot for Twitter', id: 557168941
mas 'Tyme2', id: 1063996724
